{
  "tests": [
    {
      "id": "Optional. ID of the test. Must be unique. Generated UUID if not specified.",
      "file": "Output only. File the test is defined in. All actions for a given test must be defined in a single file.",
      "status": "Output only. The status of the test based on test action results. Possible values: PASS, WARNING, FAIL",
      "actions": [
        {
          "action": "Required. Task to perform. Supported values: goTo, find, matchText, click, type, wait, screenshot",
          "alignH": "Optional. Applicable actions: moveMouse. Horizantal alignment of the mouse to the element. Accepted values: left, center, right",
          "alignV": "Optional. Applicable actions: moveMouse. Vertical alignment of the mouse to the element. Accepted values: top, center, bottom",
          "css": "Required for the following actions: find, matchText, click, type, moveMouse. CSS selectors that resolve to the element. Only returns the first element that matches the selectors.",
          "duration": "Optional. Applicable actions: wait. How long to wait in milliseconds.",
          "filename": "Optional. Applicable actions: screenshot. Name of the media file. If not specified, the filename is randomized.",
          "keys": "Optional. Applicable actions: type. Strings of keys of enter. To send special keys like 'ENTER', see 'trailingSpecialKey'.",
          "line": "Output only. Line number that the test action definition begins on.",
          "mediaDirectory": "Optional. Applicable actions: screenshot. The directory path for media created by the action. Overrides the default directory config. Default is config.imageDirectory or config.videoDirectory depending on the file type.",
          "offsetX": "Optional. Applicable actions: moveMouse. How many pixels to offset the mouse along the X axis, relative to the element center.",
          "offsetY": "Optional. Applicable actions: moveMouse. How many pixels to offset the mouse along the Y axis, relative to the element center.",
          "statusCodes": "Optional. Applicable action: checkLink. The HTTP status codes accepted from makeing a GET request to the specified URI.",
          "testId": "Optional. Input only. Only valid for non-JSON test files. ID of the test the action belongs to.",
          "text": "Required. Applicable actions: matchText. Exact text expected to display in the element.",
          "trailingSpecialKey": "Optional. Applicable actions: type. A special key pressed after the 'keys' value, if present. Supported values: https://github.com/puppeteer/puppeteer/blob/main/src/common/USKeyboardLayout.ts",
          "uri": "Required. Applicable actions: goTo, checkLink. URI to check or to navigate to in the browser.",
          "result": {
            "status": "Output only. Status based on test action results. Possible values: PASS, WARNING, FAIL",
            "description": "Output only. Explaination of the action result.",
            "image": "Output only. File path for an output image.",
            "video": "Output only. File path for an output video."
          }
        }
      ]
    }
  ]
}
